#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform

module.eks.module.eks_blueprints_addons.random_bytes.this: Refreshing state...
module.eks.module.eks_blueprints_addons.data.aws_region.current: Reading...
module.eks.module.eks_blueprints_addons.data.aws_caller_identity.current: Reading...
module.eks.module.eks.data.aws_caller_identity.current: Reading...
module.vpc.data.aws_availability_zones.azs: Reading...
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.eks_blueprints_addons.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks_blueprints_addons.data.aws_partition.current: Reading...
module.ec2["6-cd-pipeline"].data.aws_ami.image: Reading...
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_blueprints_addons.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_partition.current[0]: Reading...
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/devsecops-cicd-cluster/cluster]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_partition.current[0]: Reading...
module.ec2["6-cd-pipeline"].data.aws_availability_zones.available: Reading...
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.aws_iam_role.external-developer: Refreshing state... [id=external-developer]
aws_key_pair.ssh-key: Refreshing state... [id=devsecops-cicd-server-key]
module.eks.aws_iam_role.external-admin: Refreshing state... [id=external-admin]
module.eks.module.eks_blueprints_addons.data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=devsecops-cicd-cluster-cluster-20250115232150757700000002]
module.eks.module.eks.data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.iam_role.aws_iam_role.app-server-role: Refreshing state... [id=app-server-role-tf]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_caller_identity.current[0]: Read complete after 0s [id=326347646211]
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=326347646211]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ddd624d1226118f1]
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
data.aws_caller_identity.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_partition.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_partition.current: Read complete after 0s [id=aws]
module.vpc.data.aws_availability_zones.azs: Read complete after 0s [id=us-east-2]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks.data.aws_partition.current: Reading...
module.eks.module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_caller_identity.current: Reading...
module.ec2["6-cd-pipeline"].data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.eks.module.eks.data.aws_iam_session_context.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role.this[0]: Refreshing state... [id=initial-eks-node-group-20250115232150759800000003]
data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.iam_role.aws_iam_instance_profile.app-server-role: Refreshing state... [id=app-server-role-tf]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=devsecops-cicd-cluster-cluster-20250115232150757700000002-20250115232151312600000008]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=devsecops-cicd-cluster-cluster-20250115232150757700000002-20250115232151271500000007]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_caller_identity.current[0]: Read complete after 0s [id=326347646211]
module.eks.module.eks_blueprints_addons.data.aws_iam_policy_document.aws_load_balancer_controller[0]: Reading...
module.eks.module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::326347646211:assumed-role/devsecops-bootcamp-openid-gh-action/terraform-cidi-session]
module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=4189871641]
module.eks.module.eks_blueprints_addons.data.aws_iam_policy_document.aws_load_balancer_controller[0]: Read complete after 0s [id=2641054984]
module.eks.module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=3a5eeb7c-2424-444b-a998-18378339ec1e]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2641054984]
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.aws_iam_policy.this[0]: Refreshing state... [id=arn:aws:iam::326347646211:policy/alb-controller-20250115232150756600000001]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=initial-eks-node-group-20250115232150759800000003-20250115232151105300000004]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=initial-eks-node-group-20250115232150759800000003-20250115232151177800000005]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=initial-eks-node-group-20250115232150759800000003-20250115232151180200000006]
module.eks.module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/devsecops-cicd-cluster]
module.eks.module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::326347646211:policy/devsecops-cicd-cluster-cluster-ClusterEncryption2025011523221178410000000d]
module.ec2["6-cd-pipeline"].data.aws_ami.image: Read complete after 0s [id=ami-0862be96e41dcbf74]
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=devsecops-cicd-cluster-cluster-20250115232150757700000002-2025011523221204760000000e]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-0e292d07e7c0a7835]
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-057cb75c1bcfb374c]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-015a8b5ac0ad92a96]
module.vpc.data.aws_subnets.private_subnets: Reading...
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-0f220b32a78ad75b4]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0e5763a6e25cd0acb]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05f56def470c7b8cf]
module.vpc.data.aws_subnets.public_subnets: Reading...
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0eb4156565618d68d]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-057e137aedba58c06]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0e4b911ed8dbadf80]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-000adc423c642aae5]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d0f4a25c5a723109]
aws_default_security_group.default-sg: Refreshing state... [id=sg-057cb75c1bcfb374c]
module.vpc.data.aws_subnets.private_subnets: Read complete after 1s [id=us-east-2]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0b9f3ab7c150602cc]
module.vpc.data.aws_subnets.public_subnets: Read complete after 1s [id=us-east-2]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0af3c24fcea55642c]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d0f4a25c5a7231091080289494]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0d2380580a4746f61]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-052ac4a0a63bc48f4]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-02cfdf784f31f8770]
module.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=devsecops-cicd-cluster]
module.ec2["6-cd-pipeline"].aws_instance.app: Refreshing state... [id=i-0365ffbe5d25e2a6d]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0f8fa456ff794ee7a]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0b3eea5b7adfcacdb]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-01e5e8b04c00017bb]
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-02ad3a1db04abdd2f]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0b9f3ab7c150602cc1080289494]
module.eks.module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=devsecops-cicd-cluster:arn:aws:iam::326347646211:role/devsecops-bootcamp-openid-gh-action]
module.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.module.eks.data.tls_certificate.this[0]: Reading...
module.eks.module.eks.time_sleep.this[0]: Refreshing state... [id=2025-01-15T23:33:17Z]
module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=4734798665804096738]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_launch_template.this[0]: Refreshing state... [id=lt-0674429a1cea4dbd9]
module.eks.module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=41c9ad86376859231a2244535dff0f089ba892cb]
module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::326347646211:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/27E06FF379976469D969E172BB5AFA89]
module.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 0s [id=vpc-cni]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_eks_node_group.this[0]: Refreshing state... [id=devsecops-cicd-cluster:initial-20250115233318090500000013]
module.eks.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=devsecops-cicd-cluster#arn:aws:iam::326347646211:role/devsecops-bootcamp-openid-gh-action#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=devsecops-cicd-cluster:coredns]
module.eks.module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=devsecops-cicd-cluster:vpc-cni]
module.eks.module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=devsecops-cicd-cluster:kube-proxy]
module.eks.module.eks_blueprints_addons.time_sleep.this: Refreshing state... [id=2025-01-15T23:33:18Z]
module.eks.module.eks_blueprints_addons.aws_cloudformation_stack.usage_telemetry[0]: Refreshing state... [id=arn:aws:cloudformation:us-east-2:326347646211:stack/devsecops-cicd-cluster-8e34/07ea0910-d399-11ef-8a45-0670b3a46cf9]
module.eks.module.eks_blueprints_addons.data.aws_iam_policy_document.cluster_autoscaler[0]: Reading...
module.eks.module.eks_blueprints_addons.data.aws_iam_policy_document.cluster_autoscaler[0]: Read complete after 0s [id=3081274222]
module.eks.kubernetes_cluster_role_binding.cluster_viewer: Refreshing state... [id=cluster-viewer]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.assume[0]: Reading...
module.eks.kubernetes_namespace.online-boutique: Refreshing state... [id=online-boutique]
module.eks.kubernetes_role.namespace-viewer: Refreshing state... [id=online-boutique/namespace-viewer]
module.eks.kubernetes_role_binding.namespace-viewer: Refreshing state... [id=online-boutique/namespace-viewer]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.assume[0]: Read complete after 0s [id=709793157]
module.eks.kubernetes_cluster_role.cluster_viewer: Refreshing state... [id=cluster-viewer]
module.eks.helm_release.argocd: Refreshing state... [id=argocd]
module.eks.module.eks_aws_auth.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3081274222]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.aws_iam_role.this[0]: Refreshing state... [id=alb-controller-20250115233318672300000016]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.assume[0]: Reading...
module.eks.module.eks_blueprints_addons.module.metrics_server.helm_release.this[0]: Refreshing state... [id=metrics-server]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.assume[0]: Read complete after 0s [id=2021426637]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.aws_iam_role.this[0]: Refreshing state... [id=cluster-autoscaler-20250115233318671700000015]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.aws_iam_policy.this[0]: Refreshing state... [id=arn:aws:iam::326347646211:policy/cluster-autoscaler-20250115233248658100000010]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.aws_iam_role_policy_attachment.this[0]: Refreshing state... [id=cluster-autoscaler-20250115233318671700000015-20250115233318983800000017]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.helm_release.this[0]: Refreshing state... [id=cluster-autoscaler]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.aws_iam_role_policy_attachment.this[0]: Refreshing state... [id=alb-controller-20250115233318672300000016-20250115233319010100000018]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.helm_release.this[0]: Refreshing state... [id=aws-load-balancer-controller]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.eks.data.aws_eks_cluster.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "this" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "devsecops-cicd-cluster"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags                      = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
    }

  # module.eks.data.aws_eks_cluster_auth.this will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "this" {
      + id    = (known after apply)
      + name  = "devsecops-cicd-cluster"
      + token = (sensitive value)
    }

  # module.vpc.module.vpc.aws_default_network_acl.this[0] will be updated in-place
  ~ resource "aws_default_network_acl" "this" {
        id                     = "acl-0f220b32a78ad75b4"
      ~ tags                   = {
            "Name"                                   = "devsecops-cicd-default"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "terraform"                              = "true"
        }
      ~ tags_all               = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.vpc.module.vpc.aws_default_route_table.default[0] will be updated in-place
  ~ resource "aws_default_route_table" "default" {
        id                     = "rtb-0e292d07e7c0a7835"
      ~ tags                   = {
            "Name"                                   = "devsecops-cicd-default"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "terraform"                              = "true"
        }
      ~ tags_all               = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.vpc.module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-057cb75c1bcfb374c"
        name                   = "default"
      ~ tags                   = {
          + "Name"                                = "devsecops-cicd-default"
          + "kubernets.io/cluster/devsecops-cicd" = "shared"
          + "terraform"                           = "true"
        }
      ~ tags_all               = {
          + "Name"                                = "devsecops-cicd-default"
          + "kubernets.io/cluster/devsecops-cicd" = "shared"
          + "terraform"                           = "true"
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_eip.nat[0] will be updated in-place
  ~ resource "aws_eip" "nat" {
        id                   = "eipalloc-0af3c24fcea55642c"
      ~ tags                 = {
            "Name"                                   = "devsecops-cicd-us-east-2a"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "terraform"                              = "true"
        }
      ~ tags_all             = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_internet_gateway.this[0] will be updated in-place
  ~ resource "aws_internet_gateway" "this" {
        id       = "igw-015a8b5ac0ad92a96"
      ~ tags     = {
            "Name"                                   = "devsecops-cicd"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "terraform"                              = "true"
        }
      ~ tags_all = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (3 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_nat_gateway.this[0] will be updated in-place
  ~ resource "aws_nat_gateway" "this" {
        id                                 = "nat-02ad3a1db04abdd2f"
      ~ tags                               = {
            "Name"                                   = "devsecops-cicd-us-east-2a"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "terraform"                              = "true"
        }
      ~ tags_all                           = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (10 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_route_table.private[0] will be updated in-place
  ~ resource "aws_route_table" "private" {
        id               = "rtb-0b9f3ab7c150602cc"
      ~ tags             = {
            "Name"                                   = "devsecops-cicd-private"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "terraform"                              = "true"
        }
      ~ tags_all         = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_route_table.public[0] will be updated in-place
  ~ resource "aws_route_table" "public" {
        id               = "rtb-0d0f4a25c5a723109"
      ~ tags             = {
            "Name"                                   = "devsecops-cicd-public"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "terraform"                              = "true"
        }
      ~ tags_all         = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-05f56def470c7b8cf"
      ~ tags                                           = {
            "Name"                                   = "devsecops-cicd-private-us-east-2a"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "kubernets.io/role/internal-elb"         = "1"
            "terraform"                              = "true"
        }
      ~ tags_all                                       = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (7 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[1] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-0e4b911ed8dbadf80"
      ~ tags                                           = {
            "Name"                                   = "devsecops-cicd-private-us-east-2b"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "kubernets.io/role/internal-elb"         = "1"
            "terraform"                              = "true"
        }
      ~ tags_all                                       = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (7 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.private[2] will be updated in-place
  ~ resource "aws_subnet" "private" {
        id                                             = "subnet-000adc423c642aae5"
      ~ tags                                           = {
            "Name"                                   = "devsecops-cicd-private-us-east-2c"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "kubernets.io/role/internal-elb"         = "1"
            "terraform"                              = "true"
        }
      ~ tags_all                                       = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (7 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0e5763a6e25cd0acb"
      ~ tags                                           = {
            "Name"                                   = "devsecops-cicd-public-us-east-2a"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "kubernets.io/role/elb"                  = "1"
            "terraform"                              = "true"
        }
      ~ tags_all                                       = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (7 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.public[1] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-0eb4156565618d68d"
      ~ tags                                           = {
            "Name"                                   = "devsecops-cicd-public-us-east-2b"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "kubernets.io/role/elb"                  = "1"
            "terraform"                              = "true"
        }
      ~ tags_all                                       = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (7 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_subnet.public[2] will be updated in-place
  ~ resource "aws_subnet" "public" {
        id                                             = "subnet-057e137aedba58c06"
      ~ tags                                           = {
            "Name"                                   = "devsecops-cicd-public-us-east-2c"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "kubernets.io/role/elb"                  = "1"
            "terraform"                              = "true"
        }
      ~ tags_all                                       = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (7 unchanged elements hidden)
        }
        # (15 unchanged attributes hidden)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be updated in-place
  ~ resource "aws_vpc" "this" {
        id                                   = "vpc-0ddd624d1226118f1"
      ~ tags                                 = {
            "Name"                                   = "devsecops-cicd"
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            "terraform"                              = "true"
        }
      ~ tags_all                             = {
          + "kubernets.io/cluster/devsecops-cicd"    = "shared"
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (6 unchanged elements hidden)
        }
        # (14 unchanged attributes hidden)
    }

Plan: 0 to add, 15 to change, 0 to destroy.

```

</details>

*Pushed by: @tonyrud, Action: `pull_request`*